manual_declensions_ua = {
    "солдат": {
        "gent": "солдата",
        "datv": "солдату",
        "ablt": "солдатом"
    },
    "старший солдат": {
        "gent": "старшого солдата",
        "datv": "старшому солдату",
        "ablt": "старшим солдатом"
    },
    "молодший сержант": {
        "gent": "молодшого сержанта",
        "datv": "молодшому сержанту",
        "ablt": "молодшим сержантом"
    },
    "сержант": {
        "gent": "сержанта",
        "datv": "сержанту",
        "ablt": "сержантом"
    },
    "старший сержант": {
        "gent": "старшого сержанта",
        "datv": "старшому сержанту",
        "ablt": "старшим сержантом"
    },
    "лейтенант": {
        "gent": "лейтенанта",
        "datv": "лейтенанту",
        "ablt": "лейтенантом"
    },
    "старший лейтенант": {
        "gent": "старшого лейтенанта",
        "datv": "старшому лейтенанту",
        "ablt": "старшим лейтенантом"
    },
    "капітан": {
        "gent": "капітана",
        "datv": "капітану",
        "ablt": "капітаном"
    },
    "майор": {
        "gent": "майора",
        "datv": "майору",
        "ablt": "майором"
    },
    "підполковник": {
        "gent": "підполковника",
        "datv": "підполковнику",
        "ablt": "підполковником"
    },
    "полковник": {
        "gent": "полковника",
        "datv": "полковнику",
        "ablt": "полковником"
    }
}